HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxPsi5_reg.h
/** \brief 6E0, Receive Data Memory Low 028 */
#define PSI5_RDM0_28_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00056E0u)
/** Alias (User Manual Name) for PSI5_RDM0_28_L.
* To use register names with standard convension, please use PSI5_RDM0_28_L.
*/
#define PSI5_RDML028 (PSI5_RDM0_28_L)

/** \brief 6E4, Receive Data Memory High 028 */
#define PSI5_RDM0_28_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00056E4u)
/** Alias (User Manual Name) for PSI5_RDM0_28_H.
* To use register names with standard convension, please use PSI5_RDM0_28_H.
*/
#define PSI5_RDMH028 (PSI5_RDM0_28_H)

/** \brief 6E8, Receive Data Memory Low 029 */
#define PSI5_RDM0_29_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00056E8u)
/** Alias (User Manual Name) for PSI5_RDM0_29_L.
* To use register names with standard convension, please use PSI5_RDM0_29_L.
*/
#define PSI5_RDML029 (PSI5_RDM0_29_L)

/** \brief 6EC, Receive Data Memory High 029 */
#define PSI5_RDM0_29_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00056ECu)
/** Alias (User Manual Name) for PSI5_RDM0_29_H.
* To use register names with standard convension, please use PSI5_RDM0_29_H.
*/
#define PSI5_RDMH029 (PSI5_RDM0_29_H)

/** \brief 6F0, Receive Data Memory Low 030 */
#define PSI5_RDM0_30_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00056F0u)
/** Alias (User Manual Name) for PSI5_RDM0_30_L.
* To use register names with standard convension, please use PSI5_RDM0_30_L.
*/
#define PSI5_RDML030 (PSI5_RDM0_30_L)

/** \brief 6F4, Receive Data Memory High 030 */
#define PSI5_RDM0_30_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00056F4u)
/** Alias (User Manual Name) for PSI5_RDM0_30_H.
* To use register names with standard convension, please use PSI5_RDM0_30_H.
*/
#define PSI5_RDMH030 (PSI5_RDM0_30_H)

/** \brief 6F8, Receive Data Memory Low 031 */
#define PSI5_RDM0_31_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00056F8u)
/** Alias (User Manual Name) for PSI5_RDM0_31_L.
* To use register names with standard convension, please use PSI5_RDM0_31_L.
*/
#define PSI5_RDML031 (PSI5_RDM0_31_L)

/** \brief 6FC, Receive Data Memory High 031 */
#define PSI5_RDM0_31_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00056FCu)
/** Alias (User Manual Name) for PSI5_RDM0_31_H.
* To use register names with standard convension, please use PSI5_RDM0_31_H.
*/
#define PSI5_RDMH031 (PSI5_RDM0_31_H)

/** \brief 700, Receive Data Memory Low 10 */
#define PSI5_RDM1_0_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005700u)
/** Alias (User Manual Name) for PSI5_RDM1_0_L.
* To use register names with standard convension, please use PSI5_RDM1_0_L.
*/
#define PSI5_RDML10 (PSI5_RDM1_0_L)

/** \brief 704, Receive Data Memory High 10 */
#define PSI5_RDM1_0_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005704u)
/** Alias (User Manual Name) for PSI5_RDM1_0_H.
* To use register names with standard convension, please use PSI5_RDM1_0_H.
*/
#define PSI5_RDMH10 (PSI5_RDM1_0_H)

/** \brief 708, Receive Data Memory Low 11 */
#define PSI5_RDM1_1_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005708u)
/** Alias (User Manual Name) for PSI5_RDM1_1_L.
* To use register names with standard convension, please use PSI5_RDM1_1_L.
*/
#define PSI5_RDML11 (PSI5_RDM1_1_L)

/** \brief 70C, Receive Data Memory High 11 */
#define PSI5_RDM1_1_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000570Cu)
/** Alias (User Manual Name) for PSI5_RDM1_1_H.
* To use register names with standard convension, please use PSI5_RDM1_1_H.
*/
#define PSI5_RDMH11 (PSI5_RDM1_1_H)

/** \brief 710, Receive Data Memory Low 12 */
#define PSI5_RDM1_2_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005710u)
/** Alias (User Manual Name) for PSI5_RDM1_2_L.
* To use register names with standard convension, please use PSI5_RDM1_2_L.
*/
#define PSI5_RDML12 (PSI5_RDM1_2_L)

/** \brief 714, Receive Data Memory High 12 */
#define PSI5_RDM1_2_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005714u)
/** Alias (User Manual Name) for PSI5_RDM1_2_H.
* To use register names with standard convension, please use PSI5_RDM1_2_H.
*/
#define PSI5_RDMH12 (PSI5_RDM1_2_H)

/** \brief 718, Receive Data Memory Low 13 */
#define PSI5_RDM1_3_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005718u)
/** Alias (User Manual Name) for PSI5_RDM1_3_L.
* To use register names with standard convension, please use PSI5_RDM1_3_L.
*/
#define PSI5_RDML13 (PSI5_RDM1_3_L)

/** \brief 71C, Receive Data Memory High 13 */
#define PSI5_RDM1_3_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000571Cu)
/** Alias (User Manual Name) for PSI5_RDM1_3_H.
* To use register names with standard convension, please use PSI5_RDM1_3_H.
*/
#define PSI5_RDMH13 (PSI5_RDM1_3_H)

/** \brief 720, Receive Data Memory Low 14 */
#define PSI5_RDM1_4_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005720u)
/** Alias (User Manual Name) for PSI5_RDM1_4_L.
* To use register names with standard convension, please use PSI5_RDM1_4_L.
*/
#define PSI5_RDML14 (PSI5_RDM1_4_L)

/** \brief 724, Receive Data Memory High 14 */
#define PSI5_RDM1_4_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005724u)
/** Alias (User Manual Name) for PSI5_RDM1_4_H.
* To use register names with standard convension, please use PSI5_RDM1_4_H.
*/
#define PSI5_RDMH14 (PSI5_RDM1_4_H)

/** \brief 728, Receive Data Memory Low 15 */
#define PSI5_RDM1_5_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005728u)
/** Alias (User Manual Name) for PSI5_RDM1_5_L.
* To use register names with standard convension, please use PSI5_RDM1_5_L.
*/
#define PSI5_RDML15 (PSI5_RDM1_5_L)

/** \brief 72C, Receive Data Memory High 15 */
#define PSI5_RDM1_5_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000572Cu)
/** Alias (User Manual Name) for PSI5_RDM1_5_H.
* To use register names with standard convension, please use PSI5_RDM1_5_H.
*/
#define PSI5_RDMH15 (PSI5_RDM1_5_H)

/** \brief 730, Receive Data Memory Low 16 */
#define PSI5_RDM1_6_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005730u)
/** Alias (User Manual Name) for PSI5_RDM1_6_L.
* To use register names with standard convension, please use PSI5_RDM1_6_L.
*/
#define PSI5_RDML16 (PSI5_RDM1_6_L)

