HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxPsi5_reg.h
/** \brief 830, Receive Data Memory Low 26 */
#define PSI5_RDM2_6_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005830u)
/** Alias (User Manual Name) for PSI5_RDM2_6_L.
* To use register names with standard convension, please use PSI5_RDM2_6_L.
*/
#define PSI5_RDML26 (PSI5_RDM2_6_L)

/** \brief 834, Receive Data Memory High 26 */
#define PSI5_RDM2_6_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005834u)
/** Alias (User Manual Name) for PSI5_RDM2_6_H.
* To use register names with standard convension, please use PSI5_RDM2_6_H.
*/
#define PSI5_RDMH26 (PSI5_RDM2_6_H)

/** \brief 838, Receive Data Memory Low 27 */
#define PSI5_RDM2_7_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005838u)
/** Alias (User Manual Name) for PSI5_RDM2_7_L.
* To use register names with standard convension, please use PSI5_RDM2_7_L.
*/
#define PSI5_RDML27 (PSI5_RDM2_7_L)

/** \brief 83C, Receive Data Memory High 27 */
#define PSI5_RDM2_7_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000583Cu)
/** Alias (User Manual Name) for PSI5_RDM2_7_H.
* To use register names with standard convension, please use PSI5_RDM2_7_H.
*/
#define PSI5_RDMH27 (PSI5_RDM2_7_H)

/** \brief 840, Receive Data Memory Low 28 */
#define PSI5_RDM2_8_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005840u)
/** Alias (User Manual Name) for PSI5_RDM2_8_L.
* To use register names with standard convension, please use PSI5_RDM2_8_L.
*/
#define PSI5_RDML28 (PSI5_RDM2_8_L)

/** \brief 844, Receive Data Memory High 28 */
#define PSI5_RDM2_8_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005844u)
/** Alias (User Manual Name) for PSI5_RDM2_8_H.
* To use register names with standard convension, please use PSI5_RDM2_8_H.
*/
#define PSI5_RDMH28 (PSI5_RDM2_8_H)

/** \brief 848, Receive Data Memory Low 29 */
#define PSI5_RDM2_9_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005848u)
/** Alias (User Manual Name) for PSI5_RDM2_9_L.
* To use register names with standard convension, please use PSI5_RDM2_9_L.
*/
#define PSI5_RDML29 (PSI5_RDM2_9_L)

/** \brief 84C, Receive Data Memory High 29 */
#define PSI5_RDM2_9_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000584Cu)
/** Alias (User Manual Name) for PSI5_RDM2_9_H.
* To use register names with standard convension, please use PSI5_RDM2_9_H.
*/
#define PSI5_RDMH29 (PSI5_RDM2_9_H)

/** \brief 850, Receive Data Memory Low 210 */
#define PSI5_RDM2_10_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005850u)
/** Alias (User Manual Name) for PSI5_RDM2_10_L.
* To use register names with standard convension, please use PSI5_RDM2_10_L.
*/
#define PSI5_RDML210 (PSI5_RDM2_10_L)

/** \brief 854, Receive Data Memory High 210 */
#define PSI5_RDM2_10_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005854u)
/** Alias (User Manual Name) for PSI5_RDM2_10_H.
* To use register names with standard convension, please use PSI5_RDM2_10_H.
*/
#define PSI5_RDMH210 (PSI5_RDM2_10_H)

/** \brief 858, Receive Data Memory Low 211 */
#define PSI5_RDM2_11_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005858u)
/** Alias (User Manual Name) for PSI5_RDM2_11_L.
* To use register names with standard convension, please use PSI5_RDM2_11_L.
*/
#define PSI5_RDML211 (PSI5_RDM2_11_L)

/** \brief 85C, Receive Data Memory High 211 */
#define PSI5_RDM2_11_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000585Cu)
/** Alias (User Manual Name) for PSI5_RDM2_11_H.
* To use register names with standard convension, please use PSI5_RDM2_11_H.
*/
#define PSI5_RDMH211 (PSI5_RDM2_11_H)

/** \brief 860, Receive Data Memory Low 212 */
#define PSI5_RDM2_12_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005860u)
/** Alias (User Manual Name) for PSI5_RDM2_12_L.
* To use register names with standard convension, please use PSI5_RDM2_12_L.
*/
#define PSI5_RDML212 (PSI5_RDM2_12_L)

/** \brief 864, Receive Data Memory High 212 */
#define PSI5_RDM2_12_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005864u)
/** Alias (User Manual Name) for PSI5_RDM2_12_H.
* To use register names with standard convension, please use PSI5_RDM2_12_H.
*/
#define PSI5_RDMH212 (PSI5_RDM2_12_H)

/** \brief 868, Receive Data Memory Low 213 */
#define PSI5_RDM2_13_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005868u)
/** Alias (User Manual Name) for PSI5_RDM2_13_L.
* To use register names with standard convension, please use PSI5_RDM2_13_L.
*/
#define PSI5_RDML213 (PSI5_RDM2_13_L)

/** \brief 86C, Receive Data Memory High 213 */
#define PSI5_RDM2_13_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000586Cu)
/** Alias (User Manual Name) for PSI5_RDM2_13_H.
* To use register names with standard convension, please use PSI5_RDM2_13_H.
*/
#define PSI5_RDMH213 (PSI5_RDM2_13_H)

/** \brief 870, Receive Data Memory Low 214 */
#define PSI5_RDM2_14_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005870u)
/** Alias (User Manual Name) for PSI5_RDM2_14_L.
* To use register names with standard convension, please use PSI5_RDM2_14_L.
*/
#define PSI5_RDML214 (PSI5_RDM2_14_L)

/** \brief 874, Receive Data Memory High 214 */
#define PSI5_RDM2_14_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005874u)
/** Alias (User Manual Name) for PSI5_RDM2_14_H.
* To use register names with standard convension, please use PSI5_RDM2_14_H.
*/
#define PSI5_RDMH214 (PSI5_RDM2_14_H)

/** \brief 878, Receive Data Memory Low 215 */
#define PSI5_RDM2_15_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005878u)
/** Alias (User Manual Name) for PSI5_RDM2_15_L.
* To use register names with standard convension, please use PSI5_RDM2_15_L.
*/
#define PSI5_RDML215 (PSI5_RDM2_15_L)

/** \brief 87C, Receive Data Memory High 215 */
#define PSI5_RDM2_15_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000587Cu)
/** Alias (User Manual Name) for PSI5_RDM2_15_H.
* To use register names with standard convension, please use PSI5_RDM2_15_H.
*/
#define PSI5_RDMH215 (PSI5_RDM2_15_H)

